Revit 2016 API
RebarContainerParameterManager.AddSharedParameterAsOverride Method
 Adds a shared parameter as one of the parameter overrides stored by this Rebar Container element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2016
Syntax
C#
public void AddSharedParameterAsOverride(
	ElementId paramId
)
Visual Basic
Public Sub AddSharedParameterAsOverride ( _
	paramId As ElementId _
)
Visual C++
public:
void AddSharedParameterAsOverride(
	ElementId^ paramId
)
Parameters
paramId
Type: Autodesk.Revit.DB.ElementId
 The id of the shared parameter element
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  paramId is not a valid Element identifier. -or- paramId is not the id of a shared parameter in the current document, or its name was already used by another shared parameter of the element. -or- paramId is already a Rebar Container parameter
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
Autodesk.Revit.Exceptions.DisabledDisciplineException |  None of the following disciplines is enabled: Structural.
See Also
RebarContainerParameterManager Class
Autodesk.Revit.DB.Structure Namespace